Timo-djc/ra6m5_voice-capture/src/net/w800_at.c
#include "w800_at.h"

#include "../audio_capture.h"
#include "cloud_asr_cfg.h"

#include <stdio.h>
#include <string.h>

extern void mvp_uart5_callback(uart_callback_args_t * p_args);
extern void mvp_uart6_callback(uart_callback_args_t * p_args);

#define W800_BRIDGE_CHUNK_BYTES        (512U)
#define W800_BRIDGE_CMD_BUFFER_SIZE    (48U)
#define W800_BRIDGE_ESCAPE_GUARD_MS    (1000U)
#define W800_BRIDGE_FLASH_READY_COUNT  (8U)
#define W800_BRIDGE_ESC_BURST_COUNT    (12U)
#define W800_BRIDGE_FLASH_RETRY_MS     (1500U)
#define W800_BRIDGE_ESC_KICK_MS        (200U)
#define W800_BRIDGE_FLASH_AUTO_RUN_IDLE_MS        (4000U)
#define W800_BRIDGE_FLASH_AUTO_RUN_MIN_TX_BYTES   (262144U)
#define W800_BRIDGE_RUN_WAIT_TIMEOUT_MS           (15000U)

typedef struct st_w800_uart_channel
{
    const uart_instance_t * instance;
    const char * mcu_name;
    const char * device_name;
    volatile uint8_t * rx_ring;
    volatile bool opened;
    volatile bool tx_busy;
    volatile bool tx_ok;
    volatile uint32_t rx_head;
    volatile uint32_t rx_tail;
    uint32_t current_baud;
    uint32_t rx_bytes;
    uint32_t tx_bytes;
    uint32_t rx_events;
    uint32_t tx_complete_events;
    uint32_t error_events;
} w800_uart_channel_t;

static volatile uint8_t s_at_rx_ring[W800_RX_RING_SIZE];
static volatile uint8_t s_flash_rx_ring[W800_RX_RING_SIZE];

static w800_uart_channel_t s_at_uart =
{
    .instance = W800_AT_UART_INSTANCE,
    .mcu_name = W800_AT_UART_NAME,
    .device_name = W800_AT_DEVICE_UART_NAME,
    .rx_ring = s_at_rx_ring,
    .opened = false,
    .tx_busy = false,
    .tx_ok = true,
    .rx_head = 0U,
    .rx_tail = 0U,
    .current_baud = 0U,
    .rx_bytes = 0U,
    .tx_bytes = 0U,
    .rx_events = 0U,
    .tx_complete_events = 0U,
    .error_events = 0U
};

static w800_uart_channel_t s_flash_uart =
{
    .instance = W800_FLASH_UART_INSTANCE,
    .mcu_name = W800_FLASH_UART_NAME,
    .device_name = W800_FLASH_DEVICE_UART_NAME,
    .rx_ring = s_flash_rx_ring,
    .opened = false,
    .tx_busy = false,
    .tx_ok = true,
    .rx_head = 0U,
    .rx_tail = 0U,
    .current_baud = 0U,
    .rx_bytes = 0U,
    .tx_bytes = 0U,
    .rx_events = 0U,
    .tx_complete_events = 0U,
    .error_events = 0U
};

static uint32_t s_bridge_core_hz = 0U;

static w800_bridge_state_t s_bridge_state = W800_BRIDGE_STATE_NORMAL_APP;
static w800_bridge_state_t s_bridge_cmd_source_state = W800_BRIDGE_STATE_NORMAL_APP;
static bool s_bridge_flash_ready = false;
static bool s_bridge_run_ready = false;
static bool s_bridge_auto_exit_pending = false;

static uint8_t s_bridge_host_pending[W800_BRIDGE_CHUNK_BYTES];
static uint32_t s_bridge_host_pending_len = 0U;
static uint8_t s_bridge_dev_pending[W800_BRIDGE_CHUNK_BYTES];
static uint32_t s_bridge_dev_pending_len = 0U;

static uint8_t s_bridge_escape_count = 0U;
static uint32_t s_bridge_escape_deadline_ms = 0U;
static uint32_t s_bridge_last_host_rx_ms = 0U;
static uint32_t s_bridge_c_count = 0U;
static uint32_t s_bridge_user_task_match = 0U;
static uint32_t s_bridge_flash_retry_deadline_ms = 0U;
static uint32_t s_bridge_flash_esc_deadline_ms = 0U;
static bsp_io_level_t s_bridge_flash_boot_level = BSP_IO_LEVEL_LOW;
static bool s_bridge_flash_alt_polarity_tried = false;
static uint32_t s_bridge_flash_attempts = 0U;
static uint32_t s_bridge_escape_bursts = 0U;
static uint32_t s_bridge_flash_host_tx_bytes = 0U;
static uint32_t s_bridge_flash_last_host_tx_ms = 0U;
static bool s_bridge_flash_seen_eot = false;
static uint32_t s_bridge_run_wait_deadline_ms = 0U;

static char s_bridge_cmd_buffer[W800_BRIDGE_CMD_BUFFER_SIZE];
static uint32_t s_bridge_cmd_length = 0U;

static bsp_io_level_t inactive_level(bsp_io_level_t active_level)
{
    return (BSP_IO_LEVEL_HIGH == active_level) ? BSP_IO_LEVEL_LOW : BSP_IO_LEVEL_HIGH;
}

static uint32_t ring_next(uint32_t idx)
{
    return (idx + 1U) % W800_RX_RING_SIZE;
}

static void channel_ring_push(w800_uart_channel_t * channel, uint8_t ch)
{
    uint32_t next = ring_next(channel->rx_head);

    if (next == channel->rx_tail)
    {
        channel->rx_tail = ring_next(channel->rx_tail);
    }

    channel->rx_ring[channel->rx_head] = ch;
    channel->rx_head = next;
}

static bool channel_ring_pop(w800_uart_channel_t * channel, uint8_t * out)
{
    if (channel->rx_tail == channel->rx_head)
    {
        return false;
    }

    *out = channel->rx_ring[channel->rx_tail];
    channel->rx_tail = ring_next(channel->rx_tail);
    return true;
}

static uint32_t bridge_now_ms(void)
{
    if (0U == s_bridge_core_hz)
    {
        s_bridge_core_hz = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_ICLK);
        if (0U == s_bridge_core_hz)
        {
            s_bridge_core_hz = 1U;
        }
    }

    return (uint32_t) (((uint64_t) DWT->CYCCNT * 1000ULL) / s_bridge_core_hz);
}

static void bridge_write_force(const char * str)
{
    audio_debug_write_line_force(str);
}

static void channel_reset_rx(w800_uart_channel_t * channel)
{
    __disable_irq();
    channel->rx_head = 0U;
    channel->rx_tail = 0U;
    __enable_irq();
}

static bool channel_open(w800_uart_channel_t * channel)
{
    fsp_err_t err;

    if (channel->opened)
    {
        return true;
    }

    err = channel->instance->p_api->open(channel->instance->p_ctrl, channel->instance->p_cfg);
    if ((FSP_SUCCESS != err) && (FSP_ERR_ALREADY_OPEN != err))
    {
        return false;
    }

    channel->opened = true;
    return true;
}

static bool channel_set_baud(w800_uart_channel_t * channel, uint32_t baud)
{
    baud_setting_t setting = {0};

    if (!channel->opened)
    {
        return false;
    }

    if (FSP_SUCCESS != R_SCI_UART_BaudCalculate(baud, false, 5000U, &setting))
    {
        return false;
    }

    if (FSP_SUCCESS != channel->instance->p_api->baudSet(channel->instance->p_ctrl, &setting))
    {
        return false;
    }

    channel->current_baud = baud;
    return true;
}

static bool channel_send(w800_uart_channel_t * channel, const uint8_t * data, uint32_t len)
{
    if ((!channel->opened) || (NULL == data) || (0U == len))
    {
        return false;
    }

    if (channel->tx_busy)
    {
        return false;
    }

    channel->tx_busy = true;
    channel->tx_ok = false;

    if (FSP_SUCCESS != channel->instance->p_api->write(channel->instance->p_ctrl, data, len))
    {
        channel->tx_busy = false;
        channel->tx_ok = false;
        return false;
    }

    channel->tx_bytes += len;
    return true;
}

static bool channel_read_bytes(w800_uart_channel_t * channel, uint8_t * out, uint32_t max_bytes, uint32_t * out_read)
{
    uint32_t read_count = 0U;

    if ((NULL == out) || (0U == max_bytes))
    {
        return false;
    }

    __disable_irq();
    while ((read_count < max_bytes) && (channel->rx_tail != channel->rx_head))
    {
        out[read_count++] = channel->rx_ring[channel->rx_tail];
        channel->rx_tail = ring_next(channel->rx_tail);
    }
    __enable_irq();

    if (NULL != out_read)
    {
        *out_read = read_count;
    }

