Timo-djc/ra6m5_voice-capture/src/net/w800_at.c
    return (read_count > 0U);
}

static bool channel_read_line(w800_uart_channel_t * channel, char * out, uint32_t out_size)
{
    uint32_t idx;
    uint32_t len = 0U;
    bool found_newline = false;

    if ((NULL == out) || (out_size < 2U))
    {
        return false;
    }

    __disable_irq();

    idx = channel->rx_tail;
    while (idx != channel->rx_head)
    {
        if ('\n' == (char) channel->rx_ring[idx])
        {
            found_newline = true;
            break;
        }

        idx = ring_next(idx);
    }

    if (!found_newline)
    {
        __enable_irq();
        return false;
    }

    while (channel->rx_tail != channel->rx_head)
    {
        uint8_t ch = 0U;

        if (!channel_ring_pop(channel, &ch))
        {
            break;
        }

        if ('\n' == (char) ch)
        {
            break;
        }

        if ('\r' == (char) ch)
        {
            continue;
        }

        if (len < (out_size - 1U))
        {
            out[len++] = (char) ch;
        }
    }

    __enable_irq();

    out[len] = '\0';
    return true;
}

static bool channel_tx_idle(const w800_uart_channel_t * channel)
{
    return !channel->tx_busy;
}

static void channel_handle_callback(w800_uart_channel_t * channel, uart_callback_args_t * p_args)
{
    if (NULL == p_args)
    {
        return;
    }

    if (UART_EVENT_RX_CHAR == p_args->event)
    {
        channel->rx_events++;
        channel->rx_bytes++;
        channel_ring_push(channel, (uint8_t) p_args->data);
        return;
    }

    if (UART_EVENT_TX_COMPLETE == p_args->event)
    {
        channel->tx_complete_events++;
        channel->tx_busy = false;
        channel->tx_ok = true;
        return;
    }

    if ((UART_EVENT_ERR_PARITY == p_args->event) ||
        (UART_EVENT_ERR_FRAMING == p_args->event) ||
        (UART_EVENT_ERR_OVERFLOW == p_args->event) ||
        (UART_EVENT_BREAK_DETECT == p_args->event))
    {
        channel->error_events++;
        channel->tx_busy = false;
        channel->tx_ok = false;
    }
}

static void bridge_reset_trackers(void)
{
    s_bridge_flash_ready = false;
    s_bridge_run_ready = false;
    s_bridge_auto_exit_pending = false;
    s_bridge_host_pending_len = 0U;
    s_bridge_dev_pending_len = 0U;
    s_bridge_escape_count = 0U;
    s_bridge_escape_deadline_ms = 0U;
    s_bridge_last_host_rx_ms = bridge_now_ms();
    s_bridge_c_count = 0U;
    s_bridge_user_task_match = 0U;
    s_bridge_flash_retry_deadline_ms = 0U;
    s_bridge_flash_esc_deadline_ms = 0U;
    s_bridge_flash_boot_level = W800_BOOT_FLASH_LEVEL;
    s_bridge_flash_alt_polarity_tried = false;
    s_bridge_flash_attempts = 0U;
    s_bridge_escape_bursts = 0U;
    s_bridge_flash_host_tx_bytes = 0U;
    s_bridge_flash_last_host_tx_ms = s_bridge_last_host_rx_ms;
    s_bridge_flash_seen_eot = false;
    s_bridge_run_wait_deadline_ms = 0U;
    s_bridge_cmd_length = 0U;
    s_bridge_cmd_buffer[0] = '\0';
}

static void bridge_reset_pulse(void)
{
    w800_at_set_wakeup_level(W800_WAKE_ACTIVE_LEVEL);
    w800_at_set_reset_level(W800_RESET_ACTIVE_LEVEL);
    R_BSP_SoftwareDelay(20U, BSP_DELAY_UNITS_MILLISECONDS);
    w800_at_set_reset_level(inactive_level(W800_RESET_ACTIVE_LEVEL));
    R_BSP_SoftwareDelay(150U, BSP_DELAY_UNITS_MILLISECONDS);
}

static void bridge_wait_uart_idle(w800_uart_channel_t * channel)
{
    uint32_t timeout = 4000000U;

    while ((!channel_tx_idle(channel)) && (timeout > 0U))
    {
        timeout--;
        __NOP();
    }
}

static void bridge_send_bootloader_escape(void)
{
    uint8_t esc = 0x1BU;
    uint32_t i;

    s_bridge_escape_bursts++;

    for (i = 0U; i < W800_BRIDGE_ESC_BURST_COUNT; i++)
    {
        bridge_wait_uart_idle(&s_flash_uart);
        (void) channel_send(&s_flash_uart, &esc, 1U);
        bridge_wait_uart_idle(&s_flash_uart);
        R_BSP_SoftwareDelay(10U, BSP_DELAY_UNITS_MILLISECONDS);
    }
}

static void bridge_arm_flash_retry_timers(void)
{
    uint32_t now = bridge_now_ms();
    s_bridge_flash_retry_deadline_ms = now + W800_BRIDGE_FLASH_RETRY_MS;
    s_bridge_flash_esc_deadline_ms = now + W800_BRIDGE_ESC_KICK_MS;
}

static void bridge_start_flash_attempt(bsp_io_level_t boot_level, const char * reason)
{
    s_bridge_flash_attempts++;
    s_bridge_flash_boot_level = boot_level;
    w800_at_set_boot_level(boot_level);
    bridge_send_bootloader_escape();
    bridge_reset_pulse();
    channel_reset_rx(&s_flash_uart);
    s_bridge_c_count = 0U;
    s_bridge_flash_ready = false;
    bridge_send_bootloader_escape();
    bridge_arm_flash_retry_timers();

    if (NULL != reason)
    {
        bridge_write_force(reason);
    }
}

static void bridge_enqueue_host_byte(uint8_t ch)
{
    if (s_bridge_host_pending_len < sizeof(s_bridge_host_pending))
    {
        s_bridge_host_pending[s_bridge_host_pending_len++] = ch;
    }

    if (W800_BRIDGE_STATE_FLASH_BRIDGE == s_bridge_state)
    {
        s_bridge_flash_host_tx_bytes++;
        s_bridge_flash_last_host_tx_ms = bridge_now_ms();
        if (0x04U == ch)
        {
            s_bridge_flash_seen_eot = true;
        }
    }
}

static void bridge_flush_escape_to_host_queue(void)
{
    uint8_t i;

    for (i = 0U; i < s_bridge_escape_count; i++)
    {
        bridge_enqueue_host_byte((uint8_t) '+');
    }

    s_bridge_escape_count = 0U;
    s_bridge_escape_deadline_ms = 0U;
}

static void bridge_clear_escape_state(void)
{
    s_bridge_escape_count = 0U;
    s_bridge_escape_deadline_ms = 0U;
}

static void bridge_print_prompt(void)
{
    bridge_write_force("\r\nW800 bridge cmd> ");
}

static const char * bridge_state_name(w800_bridge_state_t state)
{
    switch (state)
    {
        case W800_BRIDGE_STATE_NORMAL_APP:
            return "NORMAL_APP";

        case W800_BRIDGE_STATE_FLASH_BRIDGE:
            return "FLASH_BRIDGE";

        case W800_BRIDGE_STATE_BRIDGE_CMD:
            return "BRIDGE_CMD";

        case W800_BRIDGE_STATE_RUN_BOOT_WAIT:
            return "RUN_BOOT_WAIT";

        default:
            return "UNKNOWN";
    }
}

