Timo-djc/ra6m5_voice-capture/src/net/w800_at.c
static const char * bridge_level_name(bsp_io_level_t level)
{
    return (BSP_IO_LEVEL_HIGH == level) ? "HIGH" : "LOW";
}

static bsp_io_level_t bridge_read_pin_level(bsp_io_port_pin_t pin)
{
    bsp_io_level_t level = BSP_IO_LEVEL_LOW;

    if (FSP_SUCCESS != g_ioport.p_api->pinRead(g_ioport.p_ctrl, pin, &level))
    {
        return BSP_IO_LEVEL_LOW;
    }

    return level;
}

static void bridge_report_pin_levels(void)
{
    char line[128];

    (void) snprintf(line,
                    sizeof(line),
                    "W800: BOOT=%s RESET=%s WAKE=%s active_flash=%s\r\n",
                    bridge_level_name(bridge_read_pin_level(W800_BOOT_PIN)),
                    bridge_level_name(bridge_read_pin_level(W800_RESET_PIN)),
                    bridge_level_name(bridge_read_pin_level(W800_WAKE_PIN)),
                    bridge_level_name(s_bridge_flash_boot_level));
    bridge_write_force(line);
}

static void bridge_report_uart_status(const char * label, const w800_uart_channel_t * channel)
{
    char line[224];

    (void) snprintf(line,
                    sizeof(line),
                    "W800: %s %s->%s baud=%lu tx_bytes=%lu rx_bytes=%lu rx_events=%lu tx_done=%lu err=%lu\r\n",
                    label,
                    channel->mcu_name,
                    channel->device_name,
                    (unsigned long) channel->current_baud,
                    (unsigned long) channel->tx_bytes,
                    (unsigned long) channel->rx_bytes,
                    (unsigned long) channel->rx_events,
                    (unsigned long) channel->tx_complete_events,
                    (unsigned long) channel->error_events);
    bridge_write_force(line);
}

static void bridge_report_status(void)
{
    char line[224];

    (void) snprintf(line,
                    sizeof(line),
                    "\r\nW800: state=%s flash_ready=%u run_ready=%u muted=%u flash_attempts=%lu esc_bursts=%lu host_uart=%s\r\n",
                    bridge_state_name(s_bridge_state),
                    s_bridge_flash_ready ? 1U : 0U,
                    s_bridge_run_ready ? 1U : 0U,
                    audio_debug_is_muted() ? 1U : 0U,
                    (unsigned long) s_bridge_flash_attempts,
                    (unsigned long) s_bridge_escape_bursts,
                    W800_HOST_UART_NAME);
    bridge_write_force(line);

    (void) snprintf(line,
                    sizeof(line),
                    "W800: flash_c_count=%lu alt=%u cmd_source=%s tx_to_flash=%lu eot=%u\r\n",
                    (unsigned long) s_bridge_c_count,
                    s_bridge_flash_alt_polarity_tried ? 1U : 0U,
                    bridge_state_name(s_bridge_cmd_source_state),
                    (unsigned long) s_bridge_flash_host_tx_bytes,
                    s_bridge_flash_seen_eot ? 1U : 0U);
    bridge_write_force(line);

#if !W800_DOWNLOAD_BRIDGE_VIA_MCU
    bridge_write_force("W800: download path=external USB-UART <-> W800 UART0 (MCU bridge disabled)\r\n");
#endif

    bridge_report_uart_status("flash_uart", &s_flash_uart);
    bridge_report_uart_status("at_uart", &s_at_uart);
    bridge_report_pin_levels();
}

static void bridge_enter_command_mode(void)
{
    s_bridge_cmd_source_state = s_bridge_state;
    s_bridge_state = W800_BRIDGE_STATE_BRIDGE_CMD;
    s_bridge_host_pending_len = 0U;
    s_bridge_dev_pending_len = 0U;
    bridge_clear_escape_state();
    s_bridge_cmd_length = 0U;
    s_bridge_cmd_buffer[0] = '\0';
    bridge_write_force("\r\nW800: bridge command mode. Commands: run, status, pins, esc, reset, retry, exit\r\n");
    bridge_print_prompt();
}

static w800_uart_channel_t * bridge_active_uart(void)
{
    if (W800_BRIDGE_STATE_FLASH_BRIDGE == s_bridge_state)
    {
        return &s_flash_uart;
    }

    if (W800_BRIDGE_STATE_RUN_BOOT_WAIT == s_bridge_state)
    {
        return &s_at_uart;
    }

    return NULL;
}

static void bridge_enter_flash_mode_with_level(bsp_io_level_t boot_level)
{
    bridge_wait_uart_idle(&s_flash_uart);
    (void) channel_set_baud(&s_flash_uart, W800_UART_FALLBACK_BAUD);
    channel_reset_rx(&s_flash_uart);
    bridge_reset_trackers();
    s_bridge_state = W800_BRIDGE_STATE_FLASH_BRIDGE;
    s_bridge_cmd_source_state = W800_BRIDGE_STATE_FLASH_BRIDGE;
    audio_debug_set_muted(true);
    bridge_start_flash_attempt(boot_level,
                               "\r\nW800: flash bridge active on SCI7<->SCI5. Expect repeated 'C' on Xshell.\r\n");
}

static void bridge_resume_normal_app(void)
{
    bridge_reset_trackers();
    s_bridge_state = W800_BRIDGE_STATE_NORMAL_APP;
    s_bridge_cmd_source_state = W800_BRIDGE_STATE_NORMAL_APP;
    audio_debug_set_muted(false);
    bridge_write_force("\r\nW800: bridge closed, returning to app mode.\r\n");
}

static void bridge_observe_flash_byte(uint8_t ch)
{
    if ('C' == (char) ch)
    {
        if (s_bridge_c_count < 0xFFFFU)
        {
            s_bridge_c_count++;
        }

        if (s_bridge_c_count >= W800_BRIDGE_FLASH_READY_COUNT)
        {
            s_bridge_flash_ready = true;
        }

        return;
    }

    if ((ch != '\r') && (ch != '\n') && (ch != ' '))
    {
        s_bridge_c_count = 0U;
    }
}

static void bridge_observe_run_byte(uint8_t ch)
{
    static const char target[] = "user task";

    if (ch == (uint8_t) target[s_bridge_user_task_match])
    {
        s_bridge_user_task_match++;
        if ('\0' == target[s_bridge_user_task_match])
        {
            s_bridge_run_ready = true;
            s_bridge_auto_exit_pending = true;
            s_bridge_user_task_match = 0U;
        }

        return;
    }

    s_bridge_user_task_match = (ch == (uint8_t) target[0]) ? 1U : 0U;
}

static void bridge_observe_device_byte(uint8_t ch)
{
    if (W800_BRIDGE_STATE_FLASH_BRIDGE == s_bridge_state)
    {
        bridge_observe_flash_byte(ch);
    }
    else if (W800_BRIDGE_STATE_RUN_BOOT_WAIT == s_bridge_state)
    {
        bridge_observe_run_byte(ch);
    }
}

static void bridge_fill_device_pending(void)
{
    uint32_t read_count = 0U;
    uint32_t i;
    w800_uart_channel_t * channel = bridge_active_uart();

    if ((NULL == channel) || (0U != s_bridge_dev_pending_len))
    {
        return;
    }

    if (!channel_read_bytes(channel, s_bridge_dev_pending, sizeof(s_bridge_dev_pending), &read_count))
    {
        return;
    }

    s_bridge_dev_pending_len = read_count;
    for (i = 0U; i < read_count; i++)
    {
        bridge_observe_device_byte(s_bridge_dev_pending[i]);
    }
}

