Timo-djc/ra6m5_voice-capture/src/net/w800_at.c
static void bridge_pump_host_to_active_uart(void)
{
    w800_uart_channel_t * channel = bridge_active_uart();

    if ((NULL == channel) || (0U == s_bridge_host_pending_len) || !channel_tx_idle(channel))
    {
        return;
    }

    if (channel_send(channel, s_bridge_host_pending, s_bridge_host_pending_len))
    {
        s_bridge_host_pending_len = 0U;
    }
}

static void bridge_pump_device_to_host(void)
{
    if ((0U == s_bridge_dev_pending_len) || !audio_debug_tx_idle())
    {
        return;
    }

    if (audio_debug_write_bytes(s_bridge_dev_pending, s_bridge_dev_pending_len))
    {
        s_bridge_dev_pending_len = 0U;
    }
}

static void bridge_host_stream_poll(bool forward_to_flash)
{
    uint8_t ch = 0U;
    uint32_t now = bridge_now_ms();

    if ((0U == s_bridge_escape_count) && (0U == s_bridge_host_pending_len))
    {
        s_bridge_last_host_rx_ms = now;
    }

    while ((forward_to_flash ? (s_bridge_host_pending_len < sizeof(s_bridge_host_pending)) : true) &&
           (1U == audio_debug_read_bytes(&ch, 1U)))
    {
        now = bridge_now_ms();

        if (0U == s_bridge_escape_count)
        {
            if ((ch == (uint8_t) '+') &&
                ((uint32_t) (now - s_bridge_last_host_rx_ms) >= W800_BRIDGE_ESCAPE_GUARD_MS))
            {
                s_bridge_escape_count = 1U;
                s_bridge_escape_deadline_ms = now + W800_BRIDGE_ESCAPE_GUARD_MS;
            }
            else if (forward_to_flash)
            {
                bridge_enqueue_host_byte(ch);
            }

            s_bridge_last_host_rx_ms = now;
            continue;
        }

        if ((ch == (uint8_t) '+') && (s_bridge_escape_count < 3U))
        {
            s_bridge_escape_count++;
            s_bridge_escape_deadline_ms = now + W800_BRIDGE_ESCAPE_GUARD_MS;
            s_bridge_last_host_rx_ms = now;

            if (3U == s_bridge_escape_count)
            {
                bridge_clear_escape_state();
                bridge_enter_command_mode();
                return;
            }

            continue;
        }

        if (forward_to_flash)
        {
            bridge_flush_escape_to_host_queue();
            bridge_enqueue_host_byte(ch);
        }
        else
        {
            bridge_clear_escape_state();
        }

        s_bridge_last_host_rx_ms = now;
    }

    now = bridge_now_ms();
    if ((s_bridge_escape_count > 0U) &&
        ((int32_t) (now - s_bridge_escape_deadline_ms) >= 0))
    {
        if (3U == s_bridge_escape_count)
        {
            bridge_clear_escape_state();
            bridge_enter_command_mode();
        }
        else if (forward_to_flash)
        {
            bridge_flush_escape_to_host_queue();
        }
        else
        {
            bridge_clear_escape_state();
        }
    }
}

static void bridge_process_transparent_mode(void)
{
    uint32_t now;
    w800_uart_channel_t * active_uart = bridge_active_uart();

    bridge_host_stream_poll((NULL != active_uart));

    if (NULL != active_uart)
    {
        bridge_pump_host_to_active_uart();
    }

    bridge_fill_device_pending();
    bridge_pump_device_to_host();

    now = bridge_now_ms();
    if ((W800_BRIDGE_STATE_FLASH_BRIDGE == s_bridge_state) && !s_bridge_flash_ready)
    {
        if ((int32_t) (now - s_bridge_flash_esc_deadline_ms) >= 0)
        {
            bridge_send_bootloader_escape();
            s_bridge_flash_esc_deadline_ms = now + W800_BRIDGE_ESC_KICK_MS;
        }

        if ((int32_t) (now - s_bridge_flash_retry_deadline_ms) >= 0)
        {
            if (!s_bridge_flash_alt_polarity_tried)
            {
                s_bridge_flash_alt_polarity_tried = true;
                bridge_start_flash_attempt(inactive_level(W800_BOOT_FLASH_LEVEL),
                                           "\r\nW800: no 'C' yet, retrying with alternate BOOT polarity.\r\n");
            }
            else
            {
                s_bridge_flash_retry_deadline_ms = now + W800_BRIDGE_FLASH_RETRY_MS;
                bridge_write_force("\r\nW800: still no 'C'. Check SCI5<->W800 UART0 wiring and BOOT/RESET mapping.\r\n");
                bridge_report_status();
            }
        }
    }

    if ((W800_BRIDGE_STATE_FLASH_BRIDGE == s_bridge_state) &&
        s_bridge_flash_ready &&
        (0U == s_bridge_host_pending_len) &&
        (0U == s_bridge_dev_pending_len) &&
        audio_debug_tx_idle() &&
        channel_tx_idle(&s_flash_uart))
    {
        bool enough_host_data = (s_bridge_flash_host_tx_bytes >= W800_BRIDGE_FLASH_AUTO_RUN_MIN_TX_BYTES);
        bool host_idle = ((uint32_t) (now - s_bridge_flash_last_host_tx_ms) >= W800_BRIDGE_FLASH_AUTO_RUN_IDLE_MS);

        if (enough_host_data && host_idle)
        {
            bridge_write_force("\r\nW800: flash transfer idle detected. Releasing BOOT and rebooting module...\r\n");
            w800_enter_run_mode();
            bridge_write_force("\r\nW800: switched to run boot mode, waiting for 'user task'.\r\n");
            return;
        }
    }

    if ((W800_BRIDGE_STATE_RUN_BOOT_WAIT == s_bridge_state) &&
        !s_bridge_run_ready &&
        (0U != s_bridge_run_wait_deadline_ms) &&
        ((int32_t) (now - s_bridge_run_wait_deadline_ms) >= 0))
    {
        bridge_write_force("\r\nW800: no 'user task' within timeout. Exiting bridge and resuming app mode.\r\n");
        bridge_resume_normal_app();
        return;
    }

    if (s_bridge_auto_exit_pending &&
        (0U == s_bridge_dev_pending_len) &&
        (0U == s_bridge_host_pending_len) &&
        audio_debug_tx_idle() &&
        (NULL != active_uart) &&
        channel_tx_idle(active_uart))
    {
        bridge_resume_normal_app();
    }
}

static void bridge_process_run_wait_external(void)
{
    uint32_t now = bridge_now_ms();

    bridge_fill_device_pending();
    bridge_pump_device_to_host();

    if (!s_bridge_run_ready &&
        (0U != s_bridge_run_wait_deadline_ms) &&
        ((int32_t) (now - s_bridge_run_wait_deadline_ms) >= 0))
    {
        bridge_write_force("\r\nW800: no 'user task' within timeout on SCI6. Returning to app mode.\r\n");
        bridge_resume_normal_app();
        return;
    }

    if (s_bridge_auto_exit_pending &&
        (0U == s_bridge_dev_pending_len) &&
        audio_debug_tx_idle() &&
        channel_tx_idle(&s_at_uart))
    {
        bridge_write_force("\r\nW800: detected 'user task' on SCI6.\r\n");
        bridge_resume_normal_app();
    }
}

static void bridge_handle_normal_command(const char * cmd)
{
    if ((NULL == cmd) || ('\0' == cmd[0]))
    {
        return;
    }

    if (0 == strcmp(cmd, "w800 flash"))
    {
        w800_enter_flash_mode();
        return;
    }

#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    if (0 == strcmp(cmd, "w800 flash_hi"))
    {
        bridge_enter_flash_mode_with_level(BSP_IO_LEVEL_HIGH);
        return;
    }

    if (0 == strcmp(cmd, "w800 flash_lo"))
    {
        bridge_enter_flash_mode_with_level(BSP_IO_LEVEL_LOW);
        return;
    }
#else
    if (0 == strcmp(cmd, "w800 flash_hi"))
    {
        w800_at_set_boot_level(BSP_IO_LEVEL_HIGH);
        bridge_reset_pulse();
        channel_reset_rx(&s_at_uart);
        bridge_write_force("\r\nW800: forced BOOT=HIGH then RESET.\r\n");
        bridge_write_force("W800: use external USB-UART on W800 UART0 for YMODEM.\r\n");
        return;
    }

    if (0 == strcmp(cmd, "w800 flash_lo"))
    {
        w800_at_set_boot_level(BSP_IO_LEVEL_LOW);
        bridge_reset_pulse();
        channel_reset_rx(&s_at_uart);
        bridge_write_force("\r\nW800: forced BOOT=LOW then RESET.\r\n");
        bridge_write_force("W800: use external USB-UART on W800 UART0 for YMODEM.\r\n");
        return;
    }
#endif

    if ((0 == strcmp(cmd, "status")) || (0 == strcmp(cmd, "w800 status")))
    {
        bridge_report_status();
        return;
    }

    if ((0 == strcmp(cmd, "w800 run")) || (0 == strcmp(cmd, "run")))
    {
        w800_enter_run_mode();
        bridge_write_force("\r\nW800: switched to run boot mode, waiting for 'user task'.\r\n");
        return;
    }

