Timo-djc/ra6m5_voice-capture/src/net/w800_at.c
    if ((0 == strcmp(cmd, "pins")) || (0 == strcmp(cmd, "w800 pins")))
    {
        bridge_report_pin_levels();
        return;
    }

    if ((0 == strcmp(cmd, "reset")) || (0 == strcmp(cmd, "w800 reset")))
    {
        bridge_reset_pulse();
        channel_reset_rx(&s_at_uart);
        bridge_write_force("\r\nW800: RESET pulse sent.\r\n");
        bridge_report_pin_levels();
        return;
    }

    if ((0 == strcmp(cmd, "help")) || (0 == strcmp(cmd, "w800 help")))
    {
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
        bridge_write_force("\r\nW800: commands: w800 flash, w800 flash_hi, w800 flash_lo, run, status, pins, reset, exit\r\n");
#else
        bridge_write_force("\r\nW800: commands: w800 flash, w800 flash_hi, w800 flash_lo, run, status, pins, reset\r\n");
        bridge_write_force("W800: note: UART0 flashing is external USB-UART, MCU only controls BOOT/RESET and SCI6 observe.\r\n");
#endif
        return;
    }

    if ((0 == strcmp(cmd, "w800 exit")) || (0 == strcmp(cmd, "exit")))
    {
        bridge_resume_normal_app();
        return;
    }

    bridge_write_force("\r\nW800: unknown command, type 'help'.\r\n");
}

static void bridge_handle_cmd_mode_command(const char * cmd)
{
    if ((NULL == cmd) || ('\0' == cmd[0]))
    {
        bridge_print_prompt();
        return;
    }

    if (0 == strcmp(cmd, "run"))
    {
        w800_enter_run_mode();
        bridge_write_force("\r\nW800: switched to run boot mode, waiting for 'user task'.\r\n");
        return;
    }

    if (0 == strcmp(cmd, "status"))
    {
        bridge_report_status();
        bridge_print_prompt();
        return;
    }

    if (0 == strcmp(cmd, "pins"))
    {
        bridge_report_pin_levels();
        bridge_print_prompt();
        return;
    }

    if (0 == strcmp(cmd, "esc"))
    {
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
        bridge_send_bootloader_escape();
        bridge_write_force("\r\nW800: sent ESC burst on SCI5 -> W800 UART0.\r\n");
#else
        bridge_write_force("\r\nW800: esc unavailable, MCU flash bridge is disabled.\r\n");
#endif
        bridge_print_prompt();
        return;
    }

    if (0 == strcmp(cmd, "reset"))
    {
        bridge_reset_pulse();
        channel_reset_rx(&s_flash_uart);
        channel_reset_rx(&s_at_uart);
        bridge_write_force("\r\nW800: pulsed RESET, RX buffers cleared.\r\n");
        bridge_report_pin_levels();
        bridge_print_prompt();
        return;
    }

    if (0 == strcmp(cmd, "retry"))
    {
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
        channel_reset_rx(&s_flash_uart);
        s_bridge_state = W800_BRIDGE_STATE_FLASH_BRIDGE;
        s_bridge_cmd_source_state = W800_BRIDGE_STATE_FLASH_BRIDGE;
        audio_debug_set_muted(true);
        bridge_start_flash_attempt(s_bridge_flash_boot_level,
                                   "\r\nW800: retried flash handshake on SCI5 -> W800 UART0.\r\n");
#else
        bridge_write_force("\r\nW800: retry unavailable, MCU flash bridge is disabled.\r\n");
        bridge_print_prompt();
#endif
        return;
    }

    if (0 == strcmp(cmd, "exit"))
    {
        bridge_resume_normal_app();
        return;
    }

    bridge_write_force("\r\nW800: unknown command. Use run, status, pins, esc, reset, retry or exit.\r\n");
    bridge_print_prompt();
}

static void bridge_command_poll(void)
{
    uint8_t temp[W800_BRIDGE_CHUNK_BYTES];
    uint32_t count = audio_debug_read_bytes(temp, sizeof(temp));
    uint32_t i;

    for (i = 0U; i < count; i++)
    {
        uint8_t ch = temp[i];

        if ((ch == '\r') || (ch == '\n'))
        {
            if (s_bridge_cmd_length > 0U)
            {
                s_bridge_cmd_buffer[s_bridge_cmd_length] = '\0';
                if (W800_BRIDGE_STATE_NORMAL_APP == s_bridge_state)
                {
                    bridge_handle_normal_command(s_bridge_cmd_buffer);
                }
                else
                {
                    bridge_handle_cmd_mode_command(s_bridge_cmd_buffer);
                }

                s_bridge_cmd_length = 0U;
                s_bridge_cmd_buffer[0] = '\0';
            }

            continue;
        }

        if ((ch == '\b') || (ch == 0x7FU))
        {
            if (s_bridge_cmd_length > 0U)
            {
                s_bridge_cmd_length--;
                s_bridge_cmd_buffer[s_bridge_cmd_length] = '\0';
            }

            continue;
        }

        if ((ch < 0x20U) || (ch > 0x7EU))
        {
            continue;
        }

        if (s_bridge_cmd_length < (sizeof(s_bridge_cmd_buffer) - 1U))
        {
            s_bridge_cmd_buffer[s_bridge_cmd_length++] = (char) ch;
            s_bridge_cmd_buffer[s_bridge_cmd_length] = '\0';
        }
    }
}

bool w800_at_init(void)
{
    if (!channel_open(&s_at_uart))
    {
        return false;
    }

    /* W800_DOWNLOAD_BRIDGE_VIA_MCU=0: UART5(SCI5) 不再作为烧写桥接使用。
     * W800 UART0 直接连接外部 USB-UART 适配器烧写固件。 */
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    if (!channel_open(&s_flash_uart))
    {
        return false;
    }
#endif

    s_bridge_state = W800_BRIDGE_STATE_NORMAL_APP;
    s_bridge_cmd_source_state = W800_BRIDGE_STATE_NORMAL_APP;
    bridge_reset_trackers();
    audio_debug_set_muted(false);
    w800_at_set_boot_level(W800_BOOT_RUN_LEVEL);
    w800_at_set_wakeup_level(W800_WAKE_ACTIVE_LEVEL);
    w800_at_set_reset_level(inactive_level(W800_RESET_ACTIVE_LEVEL));

    if (!channel_set_baud(&s_at_uart, W800_UART_TARGET_BAUD))
    {
        if (!channel_set_baud(&s_at_uart, W800_UART_FALLBACK_BAUD))
        {
            return false;
        }
    }

#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    (void) channel_set_baud(&s_flash_uart, W800_UART_FALLBACK_BAUD);
    channel_reset_rx(&s_flash_uart);
#endif
    channel_reset_rx(&s_at_uart);
    return true;
}

void w800_at_poll(void)
{
    /* Reserved for future driver-level tasks. */
}

void w800_at_reset_rx(void)
{
    channel_reset_rx(&s_at_uart);
}

bool w800_at_set_baud(uint32_t baud)
{
    return channel_set_baud(&s_at_uart, baud);
}

uint32_t w800_at_get_baud(void)
{
    return s_at_uart.current_baud;
}

