Timo-djc/ra6m5_voice-capture/src/net/w800_at.c
bool w800_at_send(const uint8_t * data, uint32_t len)
{
    return channel_send(&s_at_uart, data, len);
}

bool w800_at_send_str(const char * str)
{
    if (NULL == str)
    {
        return false;
    }

    return w800_at_send((const uint8_t *) str, (uint32_t) strlen(str));
}

bool w800_at_read_line(char * out, uint32_t out_size)
{
    return channel_read_line(&s_at_uart, out, out_size);
}

bool w800_at_read_bytes(uint8_t * out, uint32_t max_bytes, uint32_t * out_read)
{
    return channel_read_bytes(&s_at_uart, out, max_bytes, out_read);
}

bool w800_at_tx_idle(void)
{
    return channel_tx_idle(&s_at_uart);
}

bool w800_at_last_tx_ok(void)
{
    return s_at_uart.tx_ok;
}

void w800_at_set_boot_level(bsp_io_level_t level)
{
    (void) g_ioport.p_api->pinWrite(g_ioport.p_ctrl, W800_BOOT_PIN, level);
}

void w800_at_set_wakeup_level(bsp_io_level_t level)
{
    (void) g_ioport.p_api->pinWrite(g_ioport.p_ctrl, W800_WAKE_PIN, level);
}

void w800_at_set_reset_level(bsp_io_level_t level)
{
    (void) g_ioport.p_api->pinWrite(g_ioport.p_ctrl, W800_RESET_PIN, level);
}

void w800_at_hard_reset(void)
{
    bridge_wait_uart_idle(&s_at_uart);
    w800_at_set_boot_level(W800_BOOT_RUN_LEVEL);
    bridge_reset_pulse();
    channel_reset_rx(&s_at_uart);
}

void w800_enter_flash_mode(void)
{
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    bridge_enter_flash_mode_with_level(W800_BOOT_FLASH_LEVEL);
#else
    bridge_wait_uart_idle(&s_at_uart);
    (void) channel_set_baud(&s_at_uart, W800_UART_FALLBACK_BAUD);
    w800_at_set_boot_level(W800_BOOT_FLASH_LEVEL);
    bridge_reset_pulse();
    channel_reset_rx(&s_at_uart);
    bridge_reset_trackers();
    s_bridge_state = W800_BRIDGE_STATE_NORMAL_APP;
    s_bridge_cmd_source_state = W800_BRIDGE_STATE_NORMAL_APP;
    audio_debug_set_muted(false);
    bridge_write_force("\r\nW800: set to FLASH boot and reset done.\r\n");
    bridge_write_force("W800: now use external USB-UART on W800 UART0 and start YMODEM in terminal.\r\n");
#endif
}

void w800_enter_run_mode(void)
{
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    bridge_wait_uart_idle(&s_flash_uart);
#endif
    bridge_wait_uart_idle(&s_at_uart);
    (void) channel_set_baud(&s_at_uart, W800_UART_FALLBACK_BAUD);
    w800_at_set_boot_level(W800_BOOT_RUN_LEVEL);
    bridge_reset_pulse();
    channel_reset_rx(&s_at_uart);
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    channel_reset_rx(&s_flash_uart);
#endif
    bridge_reset_trackers();
    s_bridge_state = W800_BRIDGE_STATE_RUN_BOOT_WAIT;
    s_bridge_cmd_source_state = W800_BRIDGE_STATE_RUN_BOOT_WAIT;
    s_bridge_run_wait_deadline_ms = bridge_now_ms() + W800_BRIDGE_RUN_WAIT_TIMEOUT_MS;
    audio_debug_set_muted(false);
}

void w800_bridge_poll(void)
{
    if (W800_BRIDGE_STATE_NORMAL_APP == s_bridge_state)
    {
        bridge_command_poll();
        return;
    }

#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    if (W800_BRIDGE_STATE_BRIDGE_CMD == s_bridge_state)
    {
        bridge_command_poll();
        return;
    }

    bridge_process_transparent_mode();
#else
    bridge_command_poll();

    if (W800_BRIDGE_STATE_RUN_BOOT_WAIT == s_bridge_state)
    {
        bridge_process_run_wait_external();
    }
#endif /* W800_DOWNLOAD_BRIDGE_VIA_MCU */
}

bool w800_bridge_is_active(void)
{
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    return (W800_BRIDGE_STATE_NORMAL_APP != s_bridge_state);
#else
    return (W800_BRIDGE_STATE_RUN_BOOT_WAIT == s_bridge_state);
    return false; /* MCU 桥接已禁用，使用 USB-UART 适配器直连 W800 */
#endif
}

w800_bridge_state_t w800_bridge_get_state(void)
{
    return s_bridge_state;
}

void uart5_callback(uart_callback_args_t * p_args)
{
    /* W800_DOWNLOAD_BRIDGE_VIA_MCU=0: UART5 桥接已禁用，W800 UART0 直接接 USB-UART */
#if W800_DOWNLOAD_BRIDGE_VIA_MCU
    channel_handle_callback(&s_flash_uart, p_args);
#else
    (void) p_args;
#endif

    mvp_uart5_callback(p_args);
}

void uart6_callback(uart_callback_args_t * p_args)
{
    channel_handle_callback(&s_at_uart, p_args);
    mvp_uart6_callback(p_args);
}
